# if문
# 1. 조건식의 결과가 True 이면 실행한다.
# 2. 반드시 실행문은 들여쓰기로 구분한다.

# 파이썬의 들여쓰기
# 1. 일반적으로는 보기 좋은 코드 구성을 위해서 들여쓰기를 이용한다.
# 2. 파이썬은 들여쓰기가 문법화 되어 있다.

if True:
    print('True 이면 실행된다.')


age = 44
if age >= 20:
    print('성인이다.')
    print('진짜 성인이다.')


# 들여쓰기
# 1. 파이썬의 기본 값은 4spaces 이다.
# 2. 2spaces로 수정해서 사용할 수 있다.
# 3. space와 tab을 사용할 수 있다. 단, 하나만 사용해야 한다.
# 4. [Edit] - [Convert Indents] 메뉴를 이용해서 space나 tab으로 통일할 수 있다.

# 파이썬 : 파이썬 실행
#         파이썬 기본 에디터 : IDLE

# 파이참 : 코드 작성 + 오류 수정 + 실행 등 종합 세트 제공
